DataProcessors/ВыгрузкаРлРеализацийАвтоИСобытийВФайлЦэЭсВэНаСервере.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаРлРеализацийАвтоИСобытийВФайлЦэЭсВэНаСервере</Name>
			<Comment>Выгрузка Рабочих листов Реализаций автомобилей и Событий в файл CSV на сервере</Comment>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Марка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Марка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРЛ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтомобильНовый</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоВизит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
								<v8:Type>cfg:DocumentRef.РабочийЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.Событие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Дополнительные характеристики автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение дополнительного свойства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КтоВнес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВнес</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗначения</Name>
					<Comment>Вид значения дополнительного свойства автомобиля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительнаяИнформацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидАвтомобиля</Name>
			<Comment>Вид автомобиля</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
					<Comment>Новый автомобиль</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Агентский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Выкуп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_ГосУтилизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Демонстрационный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_ДемоПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Зачет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Комиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Конверсия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Консигнация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Корпоративный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_НаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_НеОпределен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Подменный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_VND</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтомобильСПробегом</Name>
					<Comment>Автомобиль с пробегом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпортБУ</Name>
					<Comment>Параллельный импорт БУ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестовыйАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодменныйАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаритетныйАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническийАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
					<Comment>Параллельный импорт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорпоративнаяКвота</Name>
					<Comment>Корпоративная квота</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственныйПарк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>Виды событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анкетирование</Name>
					<Comment>Вид события анкетирования</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаАвтомобиля</Name>
					<Comment>Вид события выдачи автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаАвтомобиля</Name>
					<Comment>Вид события замены автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
					<Comment>Личная встреча</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтАвтомобиля</Name>
					<Comment>Вид события отказа от автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереуступкаАвтомобиля</Name>
					<Comment>Вид события переуступки автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовоеПисьмо</Name>
					<Comment>Почтовое письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочее</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Comment>Телефонный звонок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестДрайв</Name>
					<Comment>Тест-драйв автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
					<Comment>Электронное письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
					<Comment>SMS событие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗвонокВежливости</Name>
					<Comment>Звонок вежливости клиенту</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаССайта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тендер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БачатаАвто</Name>
					<Comment>Событие агрегатора Бачата Авто</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОАБР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООАБР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыСообщений</Name>
			<Comment>Типы сообщений документа "Событие"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
					<Comment>Входящее сообщение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
					<Comment>Исходящее сообщение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ВыгрузкаРлРеализацийАвтоИСобытийВФайлЦэЭсВэНаСервере/Ext/ObjectModule.bsl
Процедура СформироватьЦэЭсВэНаСервере() Экспорт
	
	ГдеСоздавать = КаталогВременныхФайлов(); 
	//ГдеСоздавать = "L:\PowerBI\";
	
	ТаблицаСостав = Новый ТаблицаЗначений;
	ТаблицаСостав.Колонки.Добавить("Дата");
	ТаблицаСостав.Колонки.Добавить("Номер");
	ТаблицаСостав.Колонки.Добавить("ПодразделениеКомпании");
	ТаблицаСостав.Колонки.Добавить("ПредставлениеТелефона");
	ТаблицаСостав.Колонки.Добавить("Марка");
	ТаблицаСостав.Колонки.Добавить("АвтомобильНовый");
  	ТаблицаСостав.Колонки.Добавить("НомерРЛ");
	ТаблицаСостав.Колонки.Добавить("Чат");
	ТаблицаСостав.Колонки.Добавить("ЭтоВизит");
	ТаблицаСостав.Колонки.Добавить("Ссылка");
	
	Для Сч = 1 По 3 Цикл
		
		Если Сч = 1 Тогда
			ИмяФайла = ГдеСоздавать+"RL.CSV";
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	РабочийЛист.Дата КАК Дата,
			               |	РабочийЛист.Номер КАК Номер,
			               |	РабочийЛист.ПодразделениеКомпании КАК ПодразделениеКомпании,
			               |	РабочийЛист.ПредставлениеТелефона КАК ПредставлениеТелефона,
			               |	РабочийЛист.Модель.Марка КАК Марка,
			               |	РабочийЛист.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.РабочийЛист КАК РабочийЛист
			               |ГДЕ
			               |	РабочийЛист.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			               |	И РабочийЛист.Проведен
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Дата";
		ИначеЕсли Сч = 2 Тогда
			ИмяФайла = ГдеСоздавать+"RA.CSV";
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	РеализацияАвтомобилейАвтомобили.Ссылка.Дата КАК Дата,
			               |	РеализацияАвтомобилейАвтомобили.Ссылка.Номер КАК Номер,
			               |	РеализацияАвтомобилейАвтомобили.Ссылка.ПодразделениеКомпании КАК ПодразделениеКомпании,
			               |	РеализацияАвтомобилейАвтомобили.Ссылка.Заказчик.ОсновнойТелефон КАК ПредставлениеТелефона,
			               |	РеализацияАвтомобилейАвтомобили.Автомобиль.Модель.Марка КАК Марка,
			               |	ВЫБОР
			               |		КОГДА ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
			               |			ТОГДА ИСТИНА
			               |		ИНАЧЕ ЛОЖЬ
			               |	КОНЕЦ КАК АвтомобильНовый,
			               |	РеализацияАвтомобилейАвтомобили.Ссылка КАК Ссылка,
			               |	РеализацияАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
			               |	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль.РабочийЛист.Номер КАК НомерРЛ
			               |ИЗ
			               |	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
			               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			               |			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
			               |			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
			               |			АвтомобилиСрезПоследних.Значение КАК Значение
			               |		ИЗ
			               |			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
			               |		ГДЕ
			               |			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
			               |		ПО РеализацияАвтомобилейАвтомобили.Автомобиль = ХарАвто.Автомобиль
			               |ГДЕ
			               |	РеализацияАвтомобилейАвтомобили.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			               |	И РеализацияАвтомобилейАвтомобили.Ссылка.Проведен
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Дата";
			
		ИначеЕсли Сч = 3 Тогда	                
			ИмяФайла = ГдеСоздавать+"SB.CSV";
			Запрос = Новый Запрос;
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	Событие.ДатаОкончания КАК Дата,
			               |	Событие.Номер КАК Номер,
			               |	Событие.ПодразделениеКомпании КАК ПодразделениеКомпании,
			               |	Событие.Модель.Марка КАК Марка,
			               |	Событие.ПредставлениеТелефона КАК ПредставлениеТелефона,
			               |	Событие.ДокументОснование.Номер КАК НомерРЛ,
			               |	Событие.ВидСобытия КАК ВидСобытия,
			               |	Событие.ТипСообщения КАК ТипСообщения,
			               |	Событие.ДокументОснование.Реклама КАК Чат,
			               |	ВЫБОР
			               |		КОГДА Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЛичнаяВстреча)
			               |			ТОГДА ИСТИНА
			               |		ИНАЧЕ ЛОЖЬ
			               |	КОНЕЦ КАК ЭтоВизит
			               |ИЗ
			               |	Документ.Событие КАК Событие
			               |ГДЕ
			               |	Событие.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.Входящее)
			               |	И Событие.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
			               |	И Событие.Проведен
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Дата";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаНачала",Дата(2023,1,1));
		Запрос.УстановитьПараметр("ДатаОкончания",НачалоДня(ТекущаяДата())-1);
		
		ТаблицаСостав = Запрос.Выполнить().Выгрузить();
		
		ТекстЗН = Новый ТекстовыйДокумент; 
		
		Для каждого Строка Из ТаблицаСостав Цикл
			
			Если Сч = 1 Тогда
				ТекстЗН.ДобавитьСтроку(
				СокрЛП(Формат(Строка.Дата,"ДФ=dd.MM.yyyy"))+";"+
				СокрЛП(Строка.Номер) + ";"+
				СокрЛП(Строка.ПодразделениеКомпании) + ";"+
				СокрЛП(Строка.ПредставлениеТелефона) + ";"+
				СокрЛП(Строка.Марка) ); 
			ИначеЕсли Сч = 2 Тогда
				ТекстЗН.ДобавитьСтроку(
				СокрЛП(Формат(Строка.Дата,"ДФ=dd.MM.yyyy"))+";"+
				СокрЛП(Строка.Номер) + ";"+
				СокрЛП(Строка.ПодразделениеКомпании) + ";"+
				СокрЛП(Строка.ПредставлениеТелефона) + ";"+
				СокрЛП(Строка.Марка) + ";"+
 				СокрЛП(Строка.НомерРЛ) + ";"+
				СокрЛП(Строка.АвтомобильНовый) );
			ИначеЕсли Сч = 3 Тогда
				ТекстЗН.ДобавитьСтроку(
				СокрЛП(Формат(Строка.Дата,"ДФ=dd.MM.yyyy"))+";"+
				СокрЛП(Строка.Номер) + ";"+
				СокрЛП(Строка.ПодразделениеКомпании) + ";"+
				СокрЛП(Строка.ПредставлениеТелефона) + ";"+
				СокрЛП(Строка.Марка) + ";"+
 				СокрЛП(Строка.НомерРЛ) + ";"+
				СокрЛП(Строка.Чат) + ";"+
				СокрЛП(Строка.ЭтоВизит) );
			КонецЕсли;
 			
		КонецЦикла;
		
		Попытка
			ТекстЗН.Записать(ИмяФайла); 
			СМГ_Сообщить("Выгрузка в файл <<"+ИмяФайла+">> завершена: "+Формат(ТекущаяДата(),"ДЛФ=DDT"));
		Исключение
			СМГ_Сообщить("ОШИБКА! Не удалось записать файл : "+ИмяФайла,СтатусСообщения.ОченьВажное);		
		КонецПопытки; 
		
	КонецЦикла;

  	
КонецПроцедуры
